<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 6/21/2018
 * Time: 12:40 PM
 */

namespace backend\components;


class Data
{
    public static function GetRegion()
    {
        return [
            0 => '--',
            1 => 'ԵՐԵՎԱՆ',
            2 => 'ԱՐՄԱՎԻՐ',
            3 => 'ԿՈՏԱՅՔ',
            4 => 'ՇԻՐԱԿ',
            5 => 'ՏԱՎՈՒՇ',
        ];
    }

    public static function GetCityByRegion()
    {
        return [
            1 => [1 => 'ԵՐԵՎԱՆ'],
            2 => [1 => 'Վաղարշապատ'],
            3 => [1 => 'Նաիրի'],
            4 => [1 => 'Գյումրի'],
            5 => [1 => 'Իջևան'],
        ];
    }

    public static function GetCommunity()
    {
        return [
            1 => [
                1 => [
                    1 => 'Աջափնյակ',
                    2 => 'Ավան',
                    3 => 'Արաբկիր',
                    4 => 'Կենտրոն',
                    5 => 'Մալաթիա',
                    6 => 'Նոր Նորք',
                    7 => 'Շենգավիթ',
                    8 => 'Քանաքեռ - Զեյթուն',
                ]
            ],
            2 => [
                1 => [
                    1 => 'Վաղարշապատ'
                ]
            ],
            3 => [1 => [1 => 'Նոր-Գեղի']],
            4 => [1 => [1 => 'Գյումրի']],
            5 => [1 => [1 => 'Դիլիջան']],
        ];
    }

    public static function GetSchool()
    {
        return [
            1 => [
                1 => [
                    1 => [
                        'ք. Երևանի «Շ.Շահամիրյան» կթհ.',
                        'ք. Երևանի «Հայբուսակ» համ.-ի հենակետային ա/դ',
                        'ք. Երևանի «Գյուղատնտեսական համալսարան» ՍՊԸ-ի ա/դ',
                    ],
                    2 => [
                        'ք. Երևանի «Օհանյան»  կթհ.',
                        'ք. Երևանի «Գերմիոնա» կթհ.',
                    ],
                    3 => [
                        'ք. «Հայ-ռուսական/սլավոնական/համալսարանի ՈՒսմունք դպրոց» ՍՊԸ',
                        'ք. Երևանի «Այբ» կրթական հիմնադրամ հանգույց',
                    ],
                    4 => [
                        'ք. Երևանի «Մարտիգ» Արտաքին տնտեսական կապերի համալսարանին կից ավագ հումանիտար դպրոց',
                        'ք. Երևանի «Ռոսիա» հասարակական կազմակերպության «Սյավյանսկայա» մ/դ',
                        'ք. Երևանի «Փոքրիկ Իշխան» գիտափորձարարական կթհ.',
                        'ք. Երևանի «Մակսեդան» օտար լեզուների մ/դ',
                        'ք. Երևանի «Մաշտոց» մ/դ',
                        'ք. Երևանի Ս. Դավթի անվ. մ/դ',
                        'ք. Երևանի Հյուսիսային համալսարանի ա/դ',
                        'ք. Երևանի «ԱԶՊԱԹ-ՎԵՏԵՐԱՆ» դատական փորձագիտության և հոգեբանության ինստիտուտի ա/դ',
                        'ք. Երևանի «Գլաձոր» վարժ.',
                        'ք. Երևանի «Արեգնազան» կթհ.',
                        'ք. Երևանի «Գլոբալ Բրիջ» ՍՊԸ  ա/դ',
                        'ք. Երևանի «ՀԱՅ ԱՍՊԵՏ» Կրթադաստիարակչական բարեգործական հիմնադրամ',
                        'ք. Երևանի «ԱԻՍ ԳՐՈՒՊ» ՍՊԸ',
                        'ք. Երևանի «Գիտակ» ստեղծագործական կենտրոն',
                        'ք. Երևանի «Ակադեմիական» ՍՊԸ',
                    ],
                    5 => [
                        'ք. Երևանի «Հայ կրթություն» կրթական հիմնադրամ հմ/դ',
                        'ք. Երևանի «Ռոբերտ Ազարյան» մ/դ',
                        'ք. Երևանի «Տաթև» մ/դ',
                        'ք. Երևանի «Երևակ» կթհ.',
                    ],
                    6 => [
                        'ք. Երևանի «Էլիտա» մ/դ',
                        'ք. Երևանի «Անտիկյան կրթարան» հմ/դ',
                        'ք. Երևանի «Վարդանանք» կրթահամալիր',
                    ],
                    7 => [
                        'ք. Երևանի Ս.Թերեզային անվ. բժշկական համալսարանին կից ա/դ',
                        'ք. Երևանի «Քվանտ» վարժ.',
                        'ք. Երևանի «ԱՆԳԵԼՍ-ՊԱՐՏԵԶ» ՍՊԸ  տ/դ',
                    ],
                    8 => [
                        'ք. Երևանի «Հայաստանում եվրոպական վարժարան» հիմնադրամ',
                        'ք. Երևանի «Ուսում» մ/դ',
                        'ք. Երևանի «Բյուրակն» կթհ.',
                        'ք. Երևանի «Մխիթարեան» կթհ.',
                        'ք. Երևանի Եվրասիա համ-ի հենակետ. վարժ.',
                        'ք. Երևանի «Ադամյան դպրոց» ՍՊԸ',
                    ]
                ]
            ],
            2 => [
                1 => [

                    1 => [
                        'ք. Վաղարշապատի Մ.Ա.Ս. Էջմիածնի Էօրնեկեանի անվ. մ/դ',
                        'ք. Վաղարշապատի «Գ.Լուսավորիչ» համալսարանի լեզուների խորացված ուսուցմամբ մ/դ'
                    ]

                ]
            ],
            3 => [
                1 => [
                    1 => [
                        'գ. Նոր Գեղիի «Նաիրիի» մ/դ'
                    ]
                ]
            ],
            4 => [
                1 => [
                    1 => [
                        'ք. Գյումրու «Պրոգրես» համ.-ի հենակ. մ/դ',
                        'ք. Գյումրու «Հայբուսակ» համալսարանի մ/դ',
                        'ք. Գյումրու «Իմպրոռիթմ-արվեստի ակադեմիա» մ/դ',
                        'ք. Գյումրու «Թռչունյան տուն» մ/դ',
                    ]
                ]
            ],
            5 => [
                1 => [
                    1 => [
                        'ք.Դիլիջան «Դիլիջանի կենտրոնական դպրոց» կրթական հիմնադրամ'
                    ]
                ]
            ]
        ];
    }
}